


[

    {
        "id":1,
        "name": "Bullet Train",
        "category":"action",
        "isNew": false, 
        "describtion":"Bullet Train is a 2022 American action comedy film directed by David Leitch and starring Brad Pitt as an assassin who must battle fellow killers while riding a bullet train",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1666923052/heroes/vzednuwamwvadf7idkw4.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/0IOsk2Vlc4o",
        "released":"02/12/2020"
    },  
    {
        "id":2,
        "name": "Black Phanter",
        "category":"action",
        "isNew": false, 
        "describtion":"Black Panther is a 2018 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 18th film in the Marvel Cinematic Universe (MCU)",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1665448171/heroes/j9p5uzc5f4sxlmcdmsjb.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/xjDjIWPwcPU",
        "released":"11/03/2019"
        
    },
    {
        "id":3,
        "name": "Just go with it",
        "category":"Comedy",
        "isNew": false, 
        "describtion":"Just Go with It is a 2011 American romantic comedy film directed by Dennis Dugan, written by Allan Loeb and Timothy Dowling, and produced by Adam Sandler, Jack Giarraputo, and Heather Parry.",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1665278716/heroes/ogyi6ulhzkqiiueijazn.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/fpj7i2CPt8M",
        "released":"01/02/2023"
        
    },
    {
        "id":4,
        "name": "Thor",
        "category":"action",
        "isNew": false, 
        "describtion":"Thor, American comic strip superhero created for Marvel Comics by writer Stan Lee and artist Jack Kirby. The character, derived from the Germanic god of the same name",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1665278896/heroes/dz5o1xxznmsccc9nylrs.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/Go8nTmfrQd8",
        "released":"02/03/2021"
        
    },
    {
        "id":5,
        "name": "Iron man",
        "category":"action",
        "isNew": false, 
        "describtion":"The Iron Man film series is a cycle of three films set in the Marvel Cinematic Universe: Iron Man, Iron Man 2 and Iron Man 3. While the films in this series this series are of wildly varying quality, there is no doubt that it is foundational to the success of Marvel Studios.",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1665279039/heroes/mpkldc1q7edhf0rb8snw.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/8ugaeA-nMTc?si=1WRMpeCy6hrZ2B9z",
        "released":"02/03/2008"
        
    },
    {
        "id":6,
        "name": "The lost city",
        "category":"adventure",
        "isNew": false, 
        "describtion":"The Lost City is a 2022 American action-adventure comedy film directed by the Nee brothers, who co-wrote the screenplay with Oren Uziel and Dana Fox, based on a story by Seth Gordon. Starring Sandra Bullock, Channing Tatum, Daniel Radcliffe, Da'Vine Joy Randolph and Brad Pitt, the film follows a romance novelist and her cover model, who must escape a billionaire who wants her to find a lost ancient burial chamber described in one of her books.",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1665278465/heroes/pvkmzmg5n47telv51itu.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/nfKO9rYDmE8?si=VzQBiMAZ3ocMhNxr",
        "released":"02/03/2017"
        
    } , {
        "id":7,
        "name": "Arrow",
        "category":"action",
        "isNew": false, 
        "describtion":"Arrow is an American superhero television series developed by Greg Berlanti, Marc Guggenheim, and Andrew Kreisberg based on the DC Comics character Green Arrow, a costumed crime-fighter created by Mort Weisinger and George Papp, and is the first series of the Arrowverse, sharing continuity with other related television series. The series premiered in the United States on The CW on October 10, 2012, and ran for eight seasons until January 28, 2020. Arrow was primarily filmed in Vancouver, British Columbia, Canada.",
        "imgUrl":"https://res.cloudinary.com/dlsc2062n/image/upload/v1662388200/heroes/fc5diw1f7vtx2978zyml.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/zelD6vcSgkw?si=NpoDJ0FxWwMGhLpR",
        "released":"02/03/2018"
        
    },
    {
        "id":8,
        "name": "Fast and Furios",
        "category":"action",
        "isNew": false, 
        "describtion":"is an American action film directed by Louis Leterrier and written by Justin Lin and Dan Mazeau. It is the sequel to F9 and is the tenth film in the Fast & Furious franchise. The film stars Vin Diesel, Jason Momoa, Michelle Rodriguez, Charlize Theron, Tyrese Gibson, Chris Ludacris Bridges Jordana Brewster John Cena Nathalie Emmanuel Sung Kang Scott Eastwood Daniela Melchior Brie Larson Jason Statham and Alan Ritchson" ,
        "imgUrl":"http://res.cloudinary.com/dlsc2062n/image/upload/v1694632885/heroes/yl7jqxyszvdbuzxffyzl.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/DJWwk68t3Bs?si=RFN5CfjZrNvpFDQ7",
        "released":"02/03/2022"
        
    },
    {
        "id":9,
        "name": "Agente Stone",
        "category":"action",
        "isNew": true, 
        "describtion":"Agente Stone (título original en inglés: Heart of Stone) es una película de suspenso y acción de espías estadounidense de 2023 dirigida por Tom Harper a partir de un guion de Greg Rucka y Allison Schroeder y una historia de Rucka. 1​ La película está protagonizada por Gal Gadot, Jamie Dornan, Alia Bhatt, Sophie Okonedo y Matthias Schweighöfer." ,
        "imgUrl":"http://res.cloudinary.com/dlsc2062n/image/upload/v1694647113/heroes/kywdkamzcnma86vnmr6d.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/ooI5LY6wgMk?si=KZSxRxVSFmH77OUe",
        "released":"02/09/2023"
        
    },
    {
        "id":10,
        "name": "Happy Ending",
        "category":"Comedy",
        "isNew": true, 
        "describtion":"Un final feliz es una cinta de drama, escrita y dirigida por Michael Haneke (Amour), que cuenta con las actuaciones de Isabelle Huppert (La pianista), Jean-Louis Trintignant (Tres colores: Rojo) y Mathieu Kassovitz (Amelie)." ,
        "imgUrl":"http://res.cloudinary.com/dlsc2062n/image/upload/v1694647591/heroes/b3ljswtudknicqe8utg9.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/myICWVTMCu8?si=7P-JDbhTZXSYKv5I",
        "released":"03/08/2023"
        
    },
    {
        "id":11,
        "name": "Indiana Jones",
        "category":"adventure",
        "isNew": true, 
        "describtion":"Indiana Jones is an American media franchise consisting of five films and a prequel television series, along with games, comics, and tie-in novels, that depicts the adventures of Dr. Henry Walton Indiana Jones, Jr. portrayed in all films by Harrison Ford, a fictional professor of archaeology." ,
        "imgUrl":"http://res.cloudinary.com/dlsc2062n/image/upload/v1694647779/heroes/v96nzuiqnakll8wg4ngr.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/EVjvIL2joxQ?si=J__DwqOrLEd1S18B",
        "released":"02/09/2023"
        
    },
    {
        "id":12,
        "name": "Barbey",
        "category":"Comedy",
        "isNew": true, 
        "describtion": "Barbie es una película de comedia fantástica estadounidense de 2023, dirigida por Greta Gerwig y escrita por Gerwig y Noah Baumbach.4​ Basada en Barbie, la línea de muñecas de moda de Mattel, es la primera película de acción en vivo de Barbie, luego de numerosas películas animadas por computadora, lanzadas directas a video y por transmisión televisiva. El filme está protagonizado por Margot Robbie como Barbie, y Ryan Gosling como Ken, y sigue a los dos en un viaje de autodescubrimiento tras una crisis existencial." ,
        "imgUrl":"http://res.cloudinary.com/dlsc2062n/image/upload/v1694648120/heroes/q6d8cguexsloi6jurafn.jpg",
        "movieSrcUrl":"https://www.youtube.com/embed/gH2mRECr6y4?si=4VBDtPqKPzmGfnRe" ,
        "released":"03/08/2023"
        
    }


    
    
]